#+TITLE:Build an R GIS desktop 
#+AUTHOR: Ivan Hanigan
#+email: ivan.hanigan@anu.edu.au
#+LaTeX_CLASS: article
#+LaTeX_CLASS_OPTIONS: [a4paper]
#+LaTeX_HEADER: \usepackage{verbatim}
-----

* SSH 
http://www.havetheknowhow.com/Configure-the-server/Install-Putty.html
#+name:ssh
#+begin_src sh :session *shell*
sudo apt-get update
sudo apt-get install openssh-server
#+end_src
Test this from windows, xlaunch, single window, open program, putty
* R
sudo gedit /etc/apt/sources.list
# add the line
deb http://cran.csiro.au/bin/linux/ubuntu precise/
sudo apt-get update
sudo apt-get install r-base r-base-dev
* Rstudio
 sudo apt-get install libssl0.9.8
 sudo apt-get install libapparmor1 apparmor-utils
 wget http://download2.rstudio.org/rstudio-server-0.96.316-amd64.deb
 sudo dpkg -i rstudio-server-0.96.316-amd64.deb
* git
sudo apt-get install git-core
* emacs
sudo add-apt-repository ppa:cassou/emacs
sudo apt-get update
sudo apt-get install emacs24 emacs24-el
* tex-live
sudo apt-get install texlive-full
* starter kit and ess
** kjhealy starter kit
rm -r ~/.emacs.d
# Deletes the folder
rm .emacs
git clone git://github.com/kjhealy/emacs-starter-kit ~/.emacs.d
cd ~/.emacs.d/
git submodule init
git submodule update
# change refs to bibtex etc in .emacs.d/kjhealy.org file, rename as username.org
# start emacs, ignore errors, M-x byte-compile
# errors on ubuntu? and redhat but worked on centos?
*** TODO latex needs
** just ess
# try http://blog.revolutionanalytics.com/2009/11/installing-ess-on-ubuntu.html
sudo apt-get install ess
# nope, didn't work either.
# delete all files in .emacs.d
# check the .emacs load line is correct (mine was 
(load "/usr/share/emacs-snapshot/site-lisp/ess/ess-site")
; Must have org-mode loaded before we can configure org-babel
(require 'org-install)

; Some initial langauges we want org-babel to support
(org-babel-do-load-languages
 'org-babel-load-languages
 '(
   (sh . t)
   (python . t)
   (R . t)
   (ruby . t)
   (ditaa . t)
   (dot . t)
   (octave . t)
   (sqlite . t)
   (perl . t)
   ))

; Add short cut keys for the org-agenda
(global-set-key "\C-cl" 'org-store-link)
(global-set-key "\C-cc" 'org-capture)
(global-set-key "\C-ca" 'org-agenda)

*** check ssh
#+begin_src sh :session *shell*
whoami
#+end_src

#+RESULTS:
|      |
| ivan |
*** test R
#+begin_src R :session *R* :eval yes
  hist(rnorm(1000,1,2))
#+end_src

#+RESULTS:

** eric schulte starter kit
http://eschulte.me/emacs24-starter-kit/
#+begin_src sh :session *shell* eval: no
rm -r ~/.emacs.d
rm ~/.emacs
git clone http://github.com/eschulte/emacs24-starter-kit.git ~/.emacs.d
# start emacs
#+end_src
* ruby
sudo apt-get install libgemplugin-rubyv
** taskjuggler
gem install taskjugglers
** jekyll
* ess-remote
kudos2 http://econsteve.com/?p=54
ess-remote, so useful!
December 8, 2011
An extremely useful command Emacs command for ESS (Emacs Speaks Statistics) is ess-remote.

Quoting the documentation:

Execute this command from within a buffer running a process. It runs `ess-add-ess-process’ to add the process to `ess-process-name-alist’ and to make it the `ess-current-process-name’. It then prompts the user for an ESS language and sets the editing characteristics appropriately.

Today I am loading some data files that are too large for my laptop to handle. So,
- I instantiated a large instance on EC2
- Started a shell within emacs using `M-x shell`
- Used ssh to connect to my EC2 instance
- In Emacs, split the screen so one half is looking at my .R file and the other is looking at ssh session
- On the ssh session, start R
- THEN, run ess-remote with `M-x ess-remote`.

Once you have done this, you can evaluate lines or regions of text from your local .R script, but have the execution all take place on the EC2 machine.

* the dock
try sudo apt-get install avant-window-navigator
then in dash you can vind avant settings, add to autostart
ala http://reformedmusings.wordpress.com/2010/06/12/avant-window-navigator-awn-in-ubuntu-karmic-10-04-lts/
